In [1]:
import numpy as np
import pandas as pd

In [14]:
names = ["Nicolo", "Gabriele", "Antonio", "Goytacaz"]
stats = np.array([[10, 1, 2], [9, 3, 4], [12, 7, 3], [10, 3, 2]])
stats

array([[10,  1,  2],
       [ 9,  3,  4],
       [12,  7,  3],
       [10,  3,  2]])

In [15]:
info_df = pd.DataFrame(data = stats, index=names, columns=["Apperances", "Goals", "Assists"])
info_df

          Apperances  Goals  Assists
Nicolo            10      1        2
Gabriele           9      3        4
Antonio           12      7        3
Goytacaz          10      3        2

#### Adding "Bonus" Column

In [17]:
info_df["Bonus(x1000€)"] = info_df["Apperances"] * 0.1 + info_df["Goals"] * 0.5 + info_df["Assists"] * 0.45

          Apperances  Goals  Assists  Bonus  Bonus(x1000€)
Nicolo            10      1        2   2.40           2.40
Gabriele           9      3        4   4.20           4.20
Antonio           12      7        3   6.05           6.05
Goytacaz          10      3        2   3.40           3.40

In [18]:
info_df.drop("Bonus", axis=1)

          Apperances  Goals  Assists  Bonus(x1000€)
Nicolo            10      1        2           2.40
Gabriele           9      3        4           4.20
Antonio           12      7        3           6.05
Goytacaz          10      3        2           3.40

In [19]:
info_df

          Apperances  Goals  Assists  Bonus  Bonus(x1000€)
Nicolo            10      1        2   2.40           2.40
Gabriele           9      3        4   4.20           4.20
Antonio           12      7        3   6.05           6.05
Goytacaz          10      3        2   3.40           3.40

#### Removing A column

In [20]:
info_df.drop("Bonus", axis=1, inplace=True)

In [21]:
info_df

          Apperances  Goals  Assists  Bonus(x1000€)
Nicolo            10      1        2           2.40
Gabriele           9      3        4           4.20
Antonio           12      7        3           6.05
Goytacaz          10      3        2           3.40

#### Retrieving specific element

In [23]:
info_df.loc["Antonio"]["Bonus(x1000€)"]

6.050000000000001

In [24]:
info_df.loc["Antonio","Bonus(x1000€)"]

6.050000000000001

In [25]:
booleanFrame = info_df > 4

In [26]:
booleanFrame

          Apperances  Goals  Assists  Bonus(x1000€)
Nicolo          True  False    False          False
Gabriele        True  False    False           True
Antonio         True   True    False           True
Goytacaz        True  False    False          False

In [27]:
info_df[booleanFrame]

          Apperances  Goals  Assists  Bonus(x1000€)
Nicolo            10    NaN      NaN            NaN
Gabriele           9    NaN      NaN           4.20
Antonio           12    7.0      NaN           6.05
Goytacaz          10    NaN      NaN            NaN

In [31]:
booleanGoals = info_df["Goals"] >= 3
booleanGoals

Nicolo      False
Gabriele     True
Antonio      True
Goytacaz     True
Name: Goals, dtype: bool

In [32]:
info_df["Goals"][booleanGoals]

Gabriele    3
Antonio     7
Goytacaz    3
Name: Goals, dtype: int32